<?php

use Illuminate\Database\Seeder;

class CarModelsCarCategoriesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('car_models_car_categories')->insert([
            //Chevrolet Aveo 1.4 16V LT
            [ //1
                'car_model_id' => 1,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //2
                'car_model_id' => 1,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 1
            ],
            /*********************************************************************/
            [ //3
                'car_model_id' => 1,
                'car_category_id' => 2, //Кузов
                'parent_id' => 0
            ],
            [ //4
                'car_model_id' => 1,
                'car_category_id' => 25, //Детали кузова
                'parent_id' => 3
            ],
            /*********************************************************************/
            [ //5
                'car_model_id' => 1,
                'car_category_id' => 5, //Ходовая часть
                'parent_id' => 0
            ],
            [ //6
                'car_model_id' => 1,
                'car_category_id' => 19, //Подвеска
                'parent_id' => 5
            ],
            /*********************************************************************/
            [ //7
                'car_model_id' => 1,
                'car_category_id' => 21, //Салон
                'parent_id' => 0
            ],
            [ //8
                'car_model_id' => 1,
                'car_category_id' => 26, //Вентиляция и отопление
                'parent_id' => 7
            ],
            /*********************************************************************/

            //Chevrolet Lacetti 1.6 SE
            /*********************************************************************/
            [ //9
                'car_model_id' => 2,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //10
                'car_model_id' => 2,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 9
            ],
            /*********************************************************************/
            [ //11
                'car_model_id' => 2,
                'car_category_id' => 2, //Кузов
                'parent_id' => 0
            ],
            [ //12
                'car_model_id' => 2,
                'car_category_id' => 25, //Детали кузова
                'parent_id' => 11
            ],
            /*********************************************************************/
            [ //13
                'car_model_id' => 2,
                'car_category_id' => 5, //Ходовая часть
                'parent_id' => 0
            ],
            [ //14
                'car_model_id' => 2,
                'car_category_id' => 19, //Подвеска
                'parent_id' => 13
            ],
            /*********************************************************************/
            [ //15
                'car_model_id' => 2,
                'car_category_id' => 21, //Салон
                'parent_id' => 0
            ],
            [ //16
                'car_model_id' => 2,
                'car_category_id' => 26, //Вентиляция и отопление
                'parent_id' => 15
            ],
            /*********************************************************************/

            //Chevrolet Lacetti 1.8 CDX
            /*********************************************************************/
            [ //17
                'car_model_id' => 3,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //18
                'car_model_id' => 3,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 17
            ],
            /*********************************************************************/
            [ //19
                'car_model_id' => 3,
                'car_category_id' => 2, //Кузов
                'parent_id' => 0
            ],
            [ //20
                'car_model_id' => 3,
                'car_category_id' => 25, //Детали кузова
                'parent_id' => 19
            ],
            /*********************************************************************/
            [ //21
                'car_model_id' => 3,
                'car_category_id' => 5, //Ходовая часть
                'parent_id' => 0
            ],
            [ //22
                'car_model_id' => 3,
                'car_category_id' => 19, //Подвеска
                'parent_id' => 21
            ],
            /*********************************************************************/
            [ //23
                'car_model_id' => 3,
                'car_category_id' => 21, //Салон
                'parent_id' => 0
            ],
            [ //24
                'car_model_id' => 3,
                'car_category_id' => 26, //Вентиляция и отопление
                'parent_id' => 23
            ],
            /*********************************************************************/

            //Chevrolet Lanos
            /*********************************************************************/
            [ //25
                'car_model_id' => 4,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //26
                'car_model_id' => 4,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 25
            ],
            [ //27
                'car_model_id' => 4,
                'car_category_id' => 8, //Система выпуска
                'parent_id' => 25
            ],
            [ //28
                'car_model_id' => 4,
                'car_category_id' => 9, //Система охлаждения
                'parent_id' => 25
            ],
            [ //29
                'car_model_id' => 4,
                'car_category_id' => 10, //Система питания
                'parent_id' => 25
            ],
            /*********************************************************************/
            [ //30
                'car_model_id' => 4,
                'car_category_id' => 2, //Кузов
                'parent_id' => 0
            ],
            [ //31
                'car_model_id' => 4,
                'car_category_id' => 22, //Дверь задняя
                'parent_id' => 30
            ],
            [ //32
                'car_model_id' => 4,
                'car_category_id' => 23, //Дверь передняя
                'parent_id' => 30
            ],
            [ //33
                'car_model_id' => 4,
                'car_category_id' => 24, //Капот, крылья
                'parent_id' => 30
            ],
            [ //34
                'car_model_id' => 4,
                'car_category_id' => 25, //Детали кузова
                'parent_id' => 30
            ],
            /*********************************************************************/
            [ //35
                'car_model_id' => 4,
                'car_category_id' => 3, //Механизмы управления
                'parent_id' => 0
            ],
            [ //36
                'car_model_id' => 4,
                'car_category_id' => 11, //Тормозная система
                'parent_id' => 35
            ],
            [ //37
                'car_model_id' => 4,
                'car_category_id' => 12, //Рулевое управление
                'parent_id' => 35
            ],
            /*********************************************************************/
            [ //38
                'car_model_id' => 4,
                'car_category_id' => 4, //Трансмиссия
                'parent_id' => 0
            ],
            [ //39
                'car_model_id' => 4,
                'car_category_id' => 13, //Коробка передач
                'parent_id' => 38
            ],
            [ //40
                'car_model_id' => 4,
                'car_category_id' => 14, //Сцепление
                'parent_id' => 38
            ],
            [ //41
                'car_model_id' => 4,
                'car_category_id' => 16, //Передача карданная
                'parent_id' => 38
            ],
            /*********************************************************************/
            [ //42
                'car_model_id' => 4,
                'car_category_id' => 5, //Ходовая часть
                'parent_id' => 0
            ],
            [ //43
                'car_model_id' => 4,
                'car_category_id' => 17, //Колеса
                'parent_id' => 42
            ],
            [ //44
                'car_model_id' => 4,
                'car_category_id' => 19, //Подвеска
                'parent_id' => 42
            ],
            /*********************************************************************/
            [ //45
                'car_model_id' => 4,
                'car_category_id' => 21, //Салон
                'parent_id' => 0
            ],
            [ //46
                'car_model_id' => 4,
                'car_category_id' => 26, //Вентиляция и отопление
                'parent_id' => 45
            ],
            [ //47
                'car_model_id' => 4,
                'car_category_id' => 28, //Детали салона
                'parent_id' => 45
            ],
            /*********************************************************************/
            [ //48
                'car_model_id' => 4,
                'car_category_id' => 6, //Электрооборудование
                'parent_id' => 0
            ],
            [ //49
                'car_model_id' => 4,
                'car_category_id' => 20, //Приборы и датчики
                'parent_id' => 48
            ],
            [ //50
                'car_model_id' => 4,
                'car_category_id' => 29, //Освещение
                'parent_id' => 48
            ],
            /*********************************************************************/

            //Chevrolet Niva
            /*********************************************************************/
            [ //51
                'car_model_id' => 5,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //52
                'car_model_id' => 5,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 51
            ],
            /*********************************************************************/
            [ //53
                'car_model_id' => 5,
                'car_category_id' => 2, //Кузов
                'parent_id' => 0
            ],
            [ //54
                'car_model_id' => 5,
                'car_category_id' => 25, //Детали кузова
                'parent_id' => 53
            ],
            /*********************************************************************/
            [ //55
                'car_model_id' => 5,
                'car_category_id' => 3, //Механизмы управления
                'parent_id' => 0
            ],
            [ //56
                'car_model_id' => 5,
                'car_category_id' => 11, //Тормозная система
                'parent_id' => 55
            ],
            /*********************************************************************/
            [ //57
                'car_model_id' => 5,
                'car_category_id' => 4, //Трансмиссия
                'parent_id' => 0
            ],
            [ //58
                'car_model_id' => 5,
                'car_category_id' => 13, //Коробка передач
                'parent_id' => 57
            ],
            /*********************************************************************/
            [ //59
                'car_model_id' => 5,
                'car_category_id' => 5, //Ходовая часть
                'parent_id' => 0
            ],
            [ //60
                'car_model_id' => 5,
                'car_category_id' => 19, //Подвеска
                'parent_id' => 59
            ],
            /*********************************************************************/
            [ //61
                'car_model_id' => 5,
                'car_category_id' => 6, //Электрооборудование
                'parent_id' => 0
            ],
            [ //62
                'car_model_id' => 5,
                'car_category_id' => 20, //Приборы и датчики
                'parent_id' => 61
            ],
            /*********************************************************************/

            //Daewoo Espero
            /*********************************************************************/
            [ //63
                'car_model_id' => 6,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //64
                'car_model_id' => 6,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 64
            ],
            /*********************************************************************/

            //Daewoo Lanos
            /*********************************************************************/
            [ //65
                'car_model_id' => 7,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //66
                'car_model_id' => 7,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 65
            ],
            /*********************************************************************/

            //Daewoo Lanos SE
            /*********************************************************************/
            [ //67
                'car_model_id' => 8,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //68
                'car_model_id' => 8,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 67
            ],
            /*********************************************************************/

            //Daewoo Lanos SE 1.5
            /*********************************************************************/
            [ //69
                'car_model_id' => 9,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //70
                'car_model_id' => 9,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 69
            ],
            /*********************************************************************/

            //Daewoo Lanos SX
            /*********************************************************************/
            [ //71
                'car_model_id' => 10,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //72
                'car_model_id' => 10,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 71
            ],
            /*********************************************************************/

            //Daewoo Matiz
            /*********************************************************************/
            [ //73
                'car_model_id' => 11,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //74
                'car_model_id' => 11,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 73
            ],
            /*********************************************************************/

            //Daewoo Matiz II
            /*********************************************************************/
            [ //75
                'car_model_id' => 12,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //76
                'car_model_id' => 12,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 75
            ],
            /*********************************************************************/

            //Daewoo Nexia
            /*********************************************************************/
            [ //77
                'car_model_id' => 13,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //78
                'car_model_id' => 13,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 77
            ],
            /*********************************************************************/

            //Daewoo Tico
            /*********************************************************************/
            [ //79
                'car_model_id' => 14,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //80
                'car_model_id' => 14,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 79
            ],
            /*********************************************************************/

            //Renault Logan 1.4
            /*********************************************************************/
            [ //81
                'car_model_id' => 15,
                'car_category_id' => 5, //Ходовая часть
                'parent_id' => 0
            ],
            [ //82
                'car_model_id' => 15,
                'car_category_id' => 19, //Подвеска
                'parent_id' => 81
            ],
            /*********************************************************************/

            //Renault Logan 1.6 Laureate
            /*********************************************************************/
            [ //83
                'car_model_id' => 16,
                'car_category_id' => 5, //Ходовая часть
                'parent_id' => 0
            ],
            [ //84
                'car_model_id' => 16,
                'car_category_id' => 19, //Подвеска
                'parent_id' => 83
            ],
            /*********************************************************************/

            //Москвич 412
            /*********************************************************************/
            [ //85
                'car_model_id' => 17,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //86
                'car_model_id' => 17,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 85
            ],
            /*********************************************************************/

            //Москвич 2137
            /*********************************************************************/
            [ //87
                'car_model_id' => 18,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //88
                'car_model_id' => 18,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 87
            ],
            /*********************************************************************/

            //Москвич 2140
            /*********************************************************************/
            [ //89
                'car_model_id' => 19,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //90
                'car_model_id' => 19,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 89
            ],
            /*********************************************************************/

            //Москвич 2141
            /*********************************************************************/
            [ //91
                'car_model_id' => 20,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //92
                'car_model_id' => 20,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 91
            ],
            /*********************************************************************/

            //Москвич 2335
            /*********************************************************************/
            [ //93
                'car_model_id' => 21,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //94
                'car_model_id' => 21,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 93
            ],
            /*********************************************************************/

            //Москвич 2734
            /*********************************************************************/
            [ //95
                'car_model_id' => 22,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //96
                'car_model_id' => 22,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 95
            ],
            /*********************************************************************/

            //Москвич 400-420
            /*********************************************************************/
            [ //97
                'car_model_id' => 23,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //98
                'car_model_id' => 23,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 97
            ],
            /*********************************************************************/

            //Москвич 407
            /*********************************************************************/
            [ //99
                'car_model_id' => 24,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //100
                'car_model_id' => 24,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 99
            ],
            /*********************************************************************/

            //Lada 1117, 1118, 1119
            /*********************************************************************/
            [ //101
                'car_model_id' => 25,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //102
                'car_model_id' => 25,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 101
            ],
            /*********************************************************************/

            //Lada Granta 2190
            /*********************************************************************/
            [ //103
                'car_model_id' => 26,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //104
                'car_model_id' => 26,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 103
            ],
            /*********************************************************************/

            //ВАЗ 1111 "ОКА"
            /*********************************************************************/
            [ //105
                'car_model_id' => 27,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //106
                'car_model_id' => 27,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 105
            ],
            /*********************************************************************/

            //ВАЗ 1118 "Калина"
            /*********************************************************************/
            [ //107
                'car_model_id' => 28,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //108
                'car_model_id' => 28,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 107
            ],
            /*********************************************************************/

            //ВАЗ 2101 "Классика"
            /*********************************************************************/
            [ //109
                'car_model_id' => 29,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //110
                'car_model_id' => 29,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 109
            ],
            /*********************************************************************/

            //ВАЗ 2102
            /*********************************************************************/
            [ //111
                'car_model_id' => 30,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //112
                'car_model_id' => 30,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 111
            ],
            /*********************************************************************/

            //ВАЗ 2103
            /*********************************************************************/
            [ //113
                'car_model_id' => 31,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //114
                'car_model_id' => 31,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 113
            ],
            /*********************************************************************/

            //ВАЗ 2104
            /*********************************************************************/
            [ //115
                'car_model_id' => 32,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //116
                'car_model_id' => 32,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 115
            ],
            /*********************************************************************/

            //ВАЗ 2105
            /*********************************************************************/
            [ //117
                'car_model_id' => 33,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //118
                'car_model_id' => 33,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 117
            ],
            /*********************************************************************/

            //ВАЗ 2105 (2002)
            /*********************************************************************/
            [ //119
                'car_model_id' => 34,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //120
                'car_model_id' => 34,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 119
            ],
            /*********************************************************************/

            //ВАЗ 2106
            /*********************************************************************/
            [ //121
                'car_model_id' => 35,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //122
                'car_model_id' => 35,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 121
            ],
            /*********************************************************************/

            //ВАЗ 2106 (2002)
            /*********************************************************************/
            [ //123
                'car_model_id' => 36,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //124
                'car_model_id' => 36,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 123
            ],
            /*********************************************************************/

            //ВАЗ 2107
            /*********************************************************************/
            [ //125
                'car_model_id' => 37,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //126
                'car_model_id' => 37,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 125
            ],
            /*********************************************************************/

            //ВАЗ 2108
            /*********************************************************************/
            [ //127
                'car_model_id' => 38,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //128
                'car_model_id' => 38,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 127
            ],
            /*********************************************************************/

            //ВАЗ 2109
            /*********************************************************************/
            [ //129
                'car_model_id' => 39,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //130
                'car_model_id' => 39,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 129
            ],
            /*********************************************************************/

            //ВАЗ 21099
            /*********************************************************************/
            [ //131
                'car_model_id' => 40,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //132
                'car_model_id' => 40,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 131
            ],
            /*********************************************************************/

            //ВАЗ 2110 "Десятка"
            /*********************************************************************/
            [ //133
                'car_model_id' => 41,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //134
                'car_model_id' => 41,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 133
            ],
            /*********************************************************************/

            //ВАЗ 2110 (2007)
            /*********************************************************************/
            [ //135
                'car_model_id' => 42,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //136
                'car_model_id' => 42,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 135
            ],
            /*********************************************************************/

            //ВАЗ 2111
            /*********************************************************************/
            [ //137
                'car_model_id' => 43,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //138
                'car_model_id' => 43,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 137
            ],
            /*********************************************************************/

            //ВАЗ 2112
            /*********************************************************************/
            [ //139
                'car_model_id' => 44,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //140
                'car_model_id' => 44,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 139
            ],
            /*********************************************************************/

            //ВАЗ 2113
            /*********************************************************************/
            [ //141
                'car_model_id' => 45,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //142
                'car_model_id' => 45,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 141
            ],
            /*********************************************************************/

            //ВАЗ 2114
            /*********************************************************************/
            [ //143
                'car_model_id' => 46,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //144
                'car_model_id' => 46,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 143
            ],
            /*********************************************************************/

            //ВАЗ 2115
            /*********************************************************************/
            [ //145
                'car_model_id' => 47,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //146
                'car_model_id' => 47,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 145
            ],
            /*********************************************************************/

            //ВАЗ 2120 "Надежда"
            /*********************************************************************/
            [ //147
                'car_model_id' => 48,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //148
                'car_model_id' => 48,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 147
            ],
            /*********************************************************************/

            //ВАЗ 2121 "Нива"
            /*********************************************************************/
            [ //149
                'car_model_id' => 49,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //150
                'car_model_id' => 49,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 149
            ],
            /*********************************************************************/

            //ВАЗ 21213 "Тайга"
            /*********************************************************************/
            [ //151
                'car_model_id' => 50,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //152
                'car_model_id' => 50,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 151
            ],
            /*********************************************************************/

            //ВАЗ 21213-214i
            /*********************************************************************/
            [ //153
                'car_model_id' => 51,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //154
                'car_model_id' => 51,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 153
            ],
            /*********************************************************************/

            //ВАЗ 2123 "Шевроле"
            /*********************************************************************/
            [ //155
                'car_model_id' => 52,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //156
                'car_model_id' => 52,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 155
            ],
            /*********************************************************************/

            //ВАЗ 2131
            /*********************************************************************/
            [ //157
                'car_model_id' => 53,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //158
                'car_model_id' => 53,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 157
            ],
            /*********************************************************************/

            //ВАЗ 2170 "Приора"
            /*********************************************************************/
            [ //159
                'car_model_id' => 54,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //160
                'car_model_id' => 54,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 159
            ],
            /*********************************************************************/

            //ГАЗ 21
            /*********************************************************************/
            [ //161
                'car_model_id' => 55,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //162
                'car_model_id' => 55,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 161
            ],
            /*********************************************************************/

            //ГАЗ 24
            /*********************************************************************/
            [ //163
                'car_model_id' => 56,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //164
                'car_model_id' => 56,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 163
            ],
            /*********************************************************************/

            //ГАЗ 24-10 "Волга"
            /*********************************************************************/
            [ //165
                'car_model_id' => 57,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //166
                'car_model_id' => 57,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 165
            ],
            /*********************************************************************/

            //ГАЗ 31029
            /*********************************************************************/
            [ //167
                'car_model_id' => 58,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //168
                'car_model_id' => 58,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 167
            ],
            /*********************************************************************/

            //ZAZ Sens
            /*********************************************************************/
            [ //169
                'car_model_id' => 59,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //170
                'car_model_id' => 59,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 169
            ],
            /*********************************************************************/

            //ЗАЗ 1102 "Таврия"
            /*********************************************************************/
            [ //171
                'car_model_id' => 60,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //172
                'car_model_id' => 60,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 171
            ],
            /*********************************************************************/

            //ЗАЗ 1102 "Таврия Нова"
            /*********************************************************************/
            [ //173
                'car_model_id' => 61,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //174
                'car_model_id' => 61,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 173
            ],
            /*********************************************************************/

            //ЗАЗ 1103 "Славута"
            /*********************************************************************/
            [ //175
                'car_model_id' => 62,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //176
                'car_model_id' => 62,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 175
            ],
            /*********************************************************************/

            //ЗАЗ 1105 "Дана"
            /*********************************************************************/
            [ //177
                'car_model_id' => 63,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //178
                'car_model_id' => 63,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 177
            ],
            /*********************************************************************/

            //ЗИЛ 131
            /*********************************************************************/
            [ //179
                'car_model_id' => 64,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //180
                'car_model_id' => 64,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 179
            ],
            /*********************************************************************/

            //ЗИЛ 133ГЯ
            /*********************************************************************/
            [ //181
                'car_model_id' => 65,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //182
                'car_model_id' => 65,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 181
            ],
            /*********************************************************************/

            //ИЖ 2126
            /*********************************************************************/
            [ //183
                'car_model_id' => 66,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //184
                'car_model_id' => 66,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 183
            ],
            /*********************************************************************/

            //ИЖ 412
            /*********************************************************************/
            [ //185
                'car_model_id' => 67,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //186
                'car_model_id' => 67,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 185
            ],
            /*********************************************************************/

            //КамАЗ 4308
            /*********************************************************************/
            [ //187
                'car_model_id' => 68,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //188
                'car_model_id' => 68,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 187
            ],
            /*********************************************************************/

            //КамАЗ 4310
            /*********************************************************************/
            [ //189
                'car_model_id' => 69,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //190
                'car_model_id' => 69,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 189
            ],
            /*********************************************************************/

            //КрАЗ 255
            /*********************************************************************/
            [ //191
                'car_model_id' => 70,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //192
                'car_model_id' => 70,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 191
            ],
            /*********************************************************************/

            //КрАЗ 256
            /*********************************************************************/
            [ //193
                'car_model_id' => 71,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //194
                'car_model_id' => 71,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 193
            ],
            /*********************************************************************/

            //МАЗ 437040
            /*********************************************************************/
            [ //195
                'car_model_id' => 72,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //196
                'car_model_id' => 72,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 195
            ],
            /*********************************************************************/

            //МАЗ 500A
            /*********************************************************************/
            [ //197
                'car_model_id' => 73,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //198
                'car_model_id' => 73,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 197
            ],
            /*********************************************************************/

            //UAZ Patriot
            /*********************************************************************/
            [ //199
                'car_model_id' => 74,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //200
                'car_model_id' => 74,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 199
            ],
            /*********************************************************************/

            //УАЗ 3151
            /*********************************************************************/
            [ //201
                'car_model_id' => 75,
                'car_category_id' => 1, //Двигатель
                'parent_id' => 0
            ],
            [ //202
                'car_model_id' => 75,
                'car_category_id' => 7, //Блок двигателя
                'parent_id' => 201
            ],
            /*********************************************************************/

            //Chevrolet Aveo 1.4 16V LT
            [ //203
                'car_model_id' => 1,
                'car_category_id' => 28, //Детали салона
                'parent_id' => 7
            ],
            /*********************************************************************/
        ]);
    }
}
